{
  "en": {
    "navHome": "Home",
    "navAbout": "About Me",
    "navSkills": "Skills",
    "navProjects": "Projects",
    "navContact": "Contact",
    "welcomeMsg": "Hello, \nmy name is Tim",
    "btnResume": "Resume",
    "btnContact": "Contact",
    "aboutMeHead": "About Me",
    "aboutMeFunction": "Tim van Gestel - Front End Developer",
    "aboutMePara": "Welcome to this page, by looking at my portfolio you have\nprobably noticed that i'm a big fan of tech and development,\nbut apart from that I'm also deeply interested in music and sound and light.\nI have way more interests, but I will leave those for you to know later on.",
    "skillhead": "Skills",
    "htmlSkill": "Over the years I have learned a lot\n about html right now I know about\n everything about it.",
    "cssSkill": "By practecing and trail and error\n I learned lots about css,\nbut their is allways room for inproments.",
    "jsSkill": "With javascript I have made\nawsome web apps and I'm looking\n forward to learning some frameworks.",
    "figSkill": "When creating a webpage\nit is important to have\na design for that i prefer figma.",
    "trSkill": "When working on a project\na tool like trello is amazing to\n organise your work in one place.",
    "gitSkill": "For keeping my projects in\na safe place and a place to work together\nI use git.",
    "projectsHead": "Projects",
    "unitedPara": "I made a website for a game server on the FiveM platform.\nThe website is used to display some statistics, key binds, socials, partnerships and general information.\nThis project started out by looking at the branding material like logos and banners with this information I chose\nsome accent colors to use and started working on the design. When design I had a playful design in mind, because it is for a game server\nwith mostly younger users. After the designing stage I got on with coding and started writing the html and css.",
    "webshopPara": "I made this website mainly focused to practice on my javascript.\nOn the website you have a few products with a counter that displays the amount of that is available of that item.\nIt also has a basic nav bar with the shopping cart in it when you press the shopping cart it will take you to a new modal\nThe shopping cart items are stored in a javascript array and get deleted when the buy button is pressed.",
    "vijfluikPara": "This is a website I made to show my projects before I had this complete portfolio project.It is a grid\nbased mainpage that is devided in 5 different compartments.When you hover over a compartment it wil increase in size\nand when clicking it you will be sent to a different page.",
    "ninjaGamePara": "Step into my ninja game! It's like a cool adventure in Japan with purple landscapes.\n You're a ninja fighting others, doing jumps and cool moves.I made it using Unity and C#,\n which are like tools to build games. The game is fun for all players. You fight, find secret paths, and learn ninja secrets.\n also made a website about the game. It shows stats, controls, and cool stuff. The design is inspired by Japan and looks nice for younger players.\nCome join me in this ninja journey! Every jump and fight is like learning ninja tricks!",
    "djnbeatsPara": "This is a web application I am still working on, its made to get some experience in NodeJS and databases.\n I chose this project because I am a dj and combining my two passion whould keep me motivated to work on it. \n While building this web app i learned a lot of new things because i had little to no experience in NodeJS before hand,\n I also learned a lot about safety for a website with login credentials.",
    "verzoekenPara": "This project is a web application designed for users to submit song requests.\n Users can provide details such as the artist, song title, their name, and any additional comments through a simple web form.\n The application utilizes Node.js and Express.js to handle server-side logic and MySQL to store the submitted requests.\n The client-side of the application is built with HTML, CSS, and JavaScript to create a user-friendly interface for submitting song requests.\n When users fill out the form and submit it, the data is sent to the server, which processes and inserts the information into the MySQL database.\n The server is configured to serve static files from a designated public directory, ensuring a smooth and responsive user experience.",
    "arduinoPara": "The focus of this project was to learn more about components and programming the arduino.\n This was my first project working with a arduino and in my opinion it worked out great. \n Before everything was build and coded we made a technical design in TinkerCad circuits to test and find problems early on in the project\n What is liked about this project was that the problem solving was diverse because it chould be a software or hardware isue.",
    "duty-systeemPara": "In my spare time i made this project for a FiveM Server.\n The project is a UI that allows you to switch between jobs status so you can go on and off duty. \n I had a lot of fun figuring out how to connect the UI and the LUA and SQL thogether to make it work in FiveM\n",
    "buildWith": "Build With:"
  },
  "nl": {
    "navHome": "Home",
    "navAbout": "Over Mij",
    "navSkills": "Vaardigheden",
    "navProjects": "Projecten",
    "navContact": "Contact",
    "welcomeMsg": "Hallo, \nmijn naam is Tim",
    "btnResume": "CV",
    "btnContact": "Contact",
    "aboutMeHead": "Over Mij",
    "aboutMeFunction": "Tim van Gestel - Front End Developer",
    "aboutMePara": "Welkom, door het bekijken van mijn portfolio\nis het waarschijnlijk duidelijk dat ik nogal een fan ben van technologie en development,\nmaar naast dat ben ik ook erg geintreseerd in licht, geluid en over het algemeen muziek.\nIk heb nog een hoop extra intresses, maar die laat ik nog even voor later bewaard.",
    "skillhead": "Vaardigheden",
    "htmlSkill": "Over de jaren heen heb ik veel geleerd\nover html nu beheers ik bijna alle\nkennis die nodig is over html.",
    "cssSkill": "Door te oefenen en door te blijven zetten\nheb ik veel geleerd over css,\nmaar er is altijd ruimte voor verbeteringen.",
    "jsSkill": "Doormiddel van javascript\nheb ik mooie web apps gemaakt\nen ik wil graag meer leren over js door frameworks.",
    "figSkill": "Bij het maken van een webpagina\nis het belangrijk om een\ndesign te hebben hiervoor gebruik ik figma.",
    "trSkill": "Voor het samenwerken in projecten\nis trello een geweldige tool\ndoor functies als labels en checklists.",
    "gitSkill": "Voor het bewaren van projecten\nop een veilige plek en een plek om samen te werken\ngebruik ik git.",
    "projectsHead": "Projecten",
    "unitedPara": "Ik heb deze website gemaakt voor een game server op het FiveM Platform.\nDe website word gebruikt om statistieken weer te geven, zoals snelkoppelingen, sociale media, partnerschappen en algemenen informatie.\nDit project is gestart met het kijken naar het merk material, zoals logos's en kleuren\nhier uit heb ik wat accent kleuren gepakt om het design te beginnen. Tijdens het designen had ik een speels thema in gedachten om goed bij een game server te laten passen,\naangezien het vooral voor een jonger publiek is. Na het designen ben ik direct begonnen met het developen in html en css.",
    "webshopPara": "Ik heb deze website voornamelijk gemaakt om te focussen op mijn javascript.\nOp deze website heb je verschillende items en een vak waar staat hoeveel stuks er van dat item beschikbaar zijn.\nDe site heeft een navigatie balk met een winkelwagen erin, wanneer je er op klikt komt er een nieuw scherm in beeld met de winkelwagen.\nDe items in de winkelwagen worden bewaard in een array en worden daar uit verwijderd als je op de koop knop drukt.",
    "vijfluikPara": "Dit project gebruikte ik om mijn projecten te laten zien, voordat ik mijn portfolio had. Het is een grid\nbased hoofdpagina die verdeeld is in 5 vakken. Wanneer je over een vak heen hovert word het vak vergroot\nen, wanneer je drukt op een vak word je door gestuurd naar een aparte pagina.",
    "djnbeatsPara": "Dit is een web applicatie waar ik momenteel nog aan bezig ben, het is gemaakt om ervaring op te doen in NodeJS en databases.\n Ik koos voor dit project omdat ik een dj ben en het combineren van mijn twee passies zou me gemotiveerd houden om eraan te werken.\n Tijdens het bouwen van deze webapp heb ik veel nieuwe dingen geleerd omdat ik weinig tot geen ervaring had met NodeJS vooraf,\n Ik heb ook veel geleerd over de beveiliging van een website met inloggegevens.",
    "verzoekenPara": "Dit project is een webapplicatie ontworpen voor gebruikers om verzoeknummers in te dienen.\n Gebruikers kunnen details zoals de artiest, songtitel, hun naam en eventuele extra opmerkingen invullen via een eenvoudig webformulier.\n De applicatie maakt gebruik van Node.js en Express.js om server-side logica af te handelen en MySQL om de ingediende verzoeken op te slaan.\n De client-side van de applicatie is gebouwd met HTML, CSS en JavaScript om een gebruiksvriendelijke interface voor het indienen van verzoeknummers te creëren.\n Wanneer gebruikers het formulier invullen en indienen, wordt de data naar de server gestuurd, die het verwerkt en de informatie in de MySQL-database invoert.\n De server is geconfigureerd om statische bestanden te serveren vanuit een aangewezen publieke directory, wat zorgt voor een soepele en responsieve gebruikerservaring.",
    "arduinoPara": "Het doel van dit project was om meer te leren over componenten en het programmeren van de Arduino.\n Dit was mijn eerste project waarbij ik met een Arduino werkte en naar mijn mening verliep het prima. \n Voordat alles werd gebouwd en geprogrammeerd, hebben we een technisch ontwerp gemaakt in TinkerCad circuits om vroeg in het project te testen en problemen op te sporen.\n Wat ik leuk vond aan dit project, was dat het probleemoplossen divers was omdat het zowel een software- als hardwareprobleem kon zijn.",
    "duty-systeemPara": "In mijn vrije tijd heb ik dit project gemaakt voor een FiveM Server.\n Het project is een UI waarmee je tussen banenstatussen kunt schakelen, zodat je aan en uit dienst kunt gaan. \n Ik had veel plezier met het uitzoeken hoe ik de UI en de LUA en SQL met elkaar kon verbinden om het te laten werken in FiveM.\n",
    "buildWith": "Gebouwd Met:"
  }
}
